# Challenge 7

Another approach to identifying fraudulent transactions is to look for outliers in the data. Standard deviation or quartiles are often used to detect outliers. Using this starter notebook, code two Python functions:

* One that uses standard deviation to identify anomalies for any cardholder.

* Another that uses interquartile range to identify anomalies for any cardholder.

## Identifying Outliers using Standard Deviation

In [1]:
# Initial imports
import pandas as pd
import pandas.io.sql as sqlio
import numpy as np
import random
from sqlalchemy import create_engine
from pathlib import Path
import psycopg2
import scipy.stats as stats

In [2]:
# Create a connection to the database
# postgres_server://postgres_user:postgres_password@postgres:5432/postgres_db
engine = create_engine("postgresql://postgres:postgres@localhost:5432/Challenge 7")
engine

Engine(postgresql://postgres:***@localhost:5432/Challenge 7)

In [9]:
# Read the card_holder SQL file
query = "select * from card_holder;"

card_holder_df = sqlio.read_sql_query(query, engine)
card_holder_df

    id               name
0    1     Robert Johnson
1    2      Shane Shaffer
2    3   Elizabeth Sawyer
3    4     Danielle Green
4    5        Sara Cooper
5    6     Beth Hernandez
6    7        Sean Taylor
7    8      Michael Floyd
8    9       Laurie Gibbs
9   10  Matthew Gutierrez
10  11     Brandon Pineda
11  12        Megan Price
12  13        John Martin
13  14        Gary Jacobs
14  15        Kyle Tucker
15  16      Crystal Clark
16  17    Michael Carroll
17  18      Malik Carlson
18  19        Peter Mckay
19  20      Kevin Spencer
20  21    Dana Washington
21  22     Austin Johnson
22  23         Mark Lewis
23  24   Stephanie Dalton
24  25    Nancy Contreras

In [10]:
# Read the credit_card SQL file
query = "select * from credit_card;"

credit_card_df = sqlio.read_sql_query(query, engine)
credit_card_df

                   card  cardholder_id
0      3517111172421930              1
1   4761049645711555811              1
2   4866761290278198714              2
3          675911140852              2
4        30078299053512              3
5      4263694062533017              4
6          584226564303              4
7         4276466390111              5
8      4268491956169254              5
9      3581345943543942              6
10  4159836738768855913              6
11     3516952396080247              7
12     4539990688484983              7
13     4834483169177062              8
14       30063281385429              8
15       30181963913340              9
16  4962915017023706562             10
17  4165305432349489280             10
18      213193946980303             10
19      180098539019105             11
20  4644008655884311378             11
21     4027907156459098             11
22         501879657465             12
23     5297187379298983             12
24      376027549341849             12
25     4711773125020499             13
26     5135837688671496             13
27     3561954487988605             13
28     5175947111814778             14
29  4723783028106084756             15
30     6500236164848279             15
31         503842928916             16
32     5570600642865857             16
33     5500708021555307             16
34     6011987562414062             17
35        4498002758300             18
36      344119623920892             18
37  4743204091443101526             19
38     5361779664174555             19
39     3561072557118696             19
40     3535651398328201             20
41     4506405265172173             20
42  4586962917519654607             20
43  4279104135293225293             21
44         501809222273             22
45        4741042733274             23
46     4188164051171486             23
47     4150721559116778             23
48        4681896441519             24
49       30142966699187             24
50     3582198969197591             24
51        4319653513507             25
52      372414832802279             25

In [11]:
# Read the merchant SQL file
query = "select * from merchant;"

merchant_df = sqlio.read_sql_query(query, engine)
merchant_df

      id                          name  id_merchant_category
0      1      Murphy, Heath and Fields                     1
1      2                   Riggs-Adams                     1
2      3  Sanders, Parks and Mcfarland                     2
3      4                Mccarty-Thomas                     3
4      5                Miller-Blevins                     4
..   ...                           ...                   ...
145  146     Pitts, Smith and Gonzalez                     4
146  147                Marshall-Lopez                     5
147  148     Huerta, Keith and Walters                     5
148  149                Clark and Sons                     5
149  150              Johnson and Sons                     2

[150 rows x 3 columns]

In [12]:
# Read the merchant_category SQL file
query = "select * from merchant_category;"

merchant_category_df = sqlio.read_sql_query(query, engine)
merchant_category_df

   id         name
0   1   restaurant
1   2  coffee shop
2   3          bar
3   4          pub
4   5   food truck

In [13]:
# Read the transaction SQL file
query = "select * from transaction;"

transaction_df = sqlio.read_sql_query(query, engine)
transaction_df

        id                date  amount                 card  id_merchant
0      222 2018-01-01 21:35:10    6.22     3561954487988605           69
1     2045 2018-01-01 21:43:12    3.83     5135837688671496           85
2      395 2018-01-01 22:41:21    9.61      213193946980303           82
3     3309 2018-01-01 23:13:30   19.03     4263694062533017            5
4      567 2018-01-01 23:15:10    2.95        4498002758300           64
...    ...                 ...     ...                  ...          ...
3495  1979 2018-12-31 01:24:15    4.84  4723783028106084756          106
3496  2342 2018-12-31 03:33:28    3.26  4165305432349489280           64
3497   948 2018-12-31 05:53:58   10.73     5361779664174555           19
3498  1168 2018-12-31 08:22:17   11.87     4188164051171486           54
3499  2476 2018-12-31 09:50:25   19.75  4723783028106084756           16

[3500 rows x 5 columns]

In [8]:
# Concatenate the merchant and merchant_category DataFrames
merchant_consolidated_df = pd.concat([id, namecardholder_id],axis=1, keys=['name','card'])
merchant_consolidated_df

NameError: name 'cardholder_id' is not defined

In [14]:
# Write function that locates outliers using standard deviation
credit_record_sorted = (merchant_consolidated_df[["id", "id_merchant", "date", "amount", "card"]]
    .groupby(["name"])
    .stdev()
    .sort_values("id")
    )

# Review the DataFrame
credit_record_sorted

SyntaxError: EOL while scanning string literal (1331058910.py, line 2)

In [ ]:
# Find anomalous transactions for 3 random card holders

## Identifying Outliers Using Interquartile Range

In [ ]:
# Write a function that locates outliers using interquartile range (find Q1, Q3, and interquartile range for each column)
Q1 = data.quantile(q=.25)
Q3 = data.quantile(q=.75)
IQR = data.apply(stats.iqr)

# Only keep rows in dataframe that have values within 1.5*IQR of Q1 and Q3
data_cleaned_df = data[~((data < (Q1-1.5*IQR)) | (data > (Q3+1.5*IQR))).any(axis=1)]

# Find how many rows are left in the dataframe 
data_cleaned_df.shape

In [ ]:
# Find anomalous transactions for 3 random card holders
data_cleaned_df()